import { useTranslation } from 'react-i18next';

import cls from './details.module.scss';

const Details = () => {
  // COMPONENT HOOKS
  const { i18n } = useTranslation();

  return (
    <div className={cls.details}>
      
      <div className={`${cls.blog}`}>

        <div className={`${cls.badge} ${cls[i18n.language]}`}>

          <span>11</span>

          <span>OCT</span>

        </div>

        <img src="/assets/images/blog.jpg" alt="blogImage" className={cls.blogImage} />

        <div className={cls.info}>

          <span className={cls[i18n.language]}><i className="fa-regular fa-user"></i> بواسطة احمد</span>

          <span className={cls[i18n.language]}><i className="fa-regular fa-message-dots"></i> 3 تعليقات</span>

          <h4>تقديم حلول أفضل للأجيال القادمة</h4>

          <p>هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا هذا النص لملئ الفراغات ليس إلا </p>

        </div>

        <div className={cls.tags}>

          <div className={`${cls.part} ${cls.partOne}`}>

            <p>العلامات:</p>
            <span>تكنولوجيا</span>
            <span>واقع افتراضي</span>
            <span>ذكاء اصطناعي</span>

          </div>

          <div className={cls.part}>

            <i className="fa-brands fa-facebook-f"></i>

            <i className="fa-brands fa-twitter"></i>

            <i className="fa-brands fa-instagram"></i>

            <i className="fa-brands fa-youtube"></i>

          </div>

        </div>

        <div className={cls.comments}>

          <h4>التعليقات (3):</h4>

          <div className={cls.comment}>

            <div className={cls.userWrapper}>

              <div className={cls.user}>

                <img src="/assets/images/user.jpg" alt="user" />

                <div className={cls.info}>

                  <h5>ahmad eid</h5>

                  <p>OCT 11, 2019</p>

                </div>

              </div>

              <span className={cls.reply}>الرد <i className="fa-light fa-reply-all"></i></span>

            </div>

            <p>هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا </p>

          </div>

          <div className={cls.comment}>

            <div className={cls.userWrapper}>

              <div className={cls.user}>

                <img src="/assets/images/user.jpg" alt="user" />

                <div className={cls.info}>

                  <h5>ahmad eid</h5>

                  <p>OCT 11, 2019</p>

                </div>

              </div>

              <span className={cls.reply}>الرد <i className="fa-light fa-reply-all"></i></span>

            </div>

            <p>هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا </p>

          </div>

          <div className={cls.comment}>

            <div className={cls.userWrapper}>

              <div className={cls.user}>

                <img src="/assets/images/user.jpg" alt="user" />

                <div className={cls.info}>

                  <h5>ahmad eid</h5>

                  <p>OCT 11, 2019</p>

                </div>

              </div>

              <span className={cls.reply}>الرد <i className="fa-light fa-reply-all"></i></span>

            </div>

            <p>هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا هذا المنشور جميل جدا </p>

          </div>

        </div>

        <div className={cls.form}>

          <h3>إنشر تعليق جديد</h3>

          <div className="row">

            <div className="col-md-6">

              <label>الإسم<span>*</span></label>

              <input type="text" placeholder='الإسم' />

            </div>

            <div className="col-md-6">

              <label>البريد الإلكتروني<span>*</span></label>

              <input type="text" placeholder='البريد الإلكتروني' />

            </div>

            <div className="col-md-12">

              <label>الموقع الإلكتروني<span>*</span></label>

              <input type="text" placeholder='الموقع الإلكتروني' />

            </div>

            <div className="col-xs-12">

              <label>التعليق<span>*</span></label>

              <textarea placeholder='التعليق'></textarea>

            </div>

            <button>نشر التعليق</button>

          </div>

        </div>

      </div>
    </div>
  )
}

export default Details