import cls from './universityInfo.module.scss';

const UniversityInfo = () => {
  return (
    <div className={cls.universityInfo}>

      <div className='container'>

        <div className={`${cls.analytics} row justify-content-center`}>

          <div className='col-md-6 col-lg-4'>

            <div className={cls.one}>

              <img src="/assets/images/planet2.png" alt="planet" />

              <div>

                <span>34</span>

                <p>لترتيب الدولي</p>

              </div>

            </div>

          </div>

          <div className='col-md-6 col-lg-4'>

            <div className={cls.one}>

              <img src="/assets/images/location.png" alt="country" />

              <div>

                <span>34</span>

                <p>لترتيب المحلي</p>

              </div>

            </div>

          </div>

          <div className='col-md-6 col-lg-4'>

            <div className={cls.one}>

              <img src="/assets/images/student.png" alt="student" />

              <div>

                <span>34</span>

                <p>طالب</p>

              </div>

            </div>

          </div>

        </div>

        <h6><i className="fa-regular fa-circle-dot"></i> جامعة <span>القاهرة</span> بيلجي تسعى دائماً لأن تكون ضمن المراتب الأولى في ترتيب الجامعات حيث أن الجامعة لديها عدة إعترافات عالمية وهي عضو في رابطة الجامعات الأوربية EUA وفي عدة مؤسسات دولية.</h6>

        <h6><i className="fa-regular fa-circle-dot"></i> حيث تم تصنيف جامعة اسطنبول بيلجي في المركز الـ <span>4</span> على مستوى الجامعات التركية طبقًا لتصنيف QS Ranking لعام 2019.</h6>

        <div className={cls.data}>

          <ul>

            <li>وكذلك حاصله علي إعتماد MÜDEK للعلوم الهندسية، وإعتماد TPD لقسم علم النفس من قبل جمعية علماء النفس التركية</li>

            <li>لديها برامج التبادل الطلابي مثل برنامج إيراسموس الذي يعطي فرصة للطلاب دراسة سنة أو فصل في أي جامعة من دول الاتحاد الأوروبي، و برنامج فارابي الخاص بتركيا والعديد من دول العالم منها كندا وأميركا وأستراليا</li>

            <li>تعتبر جزء من شبكة جامعات حاصلة على جائزة نوبل وتعتبر العضوة الوحيدة في تركيا للشبكة الرائدة لجامعات لوريات العالمية منذ 2006 وتدرس الجامعة أغلب اختصاصاتها باللغة الإنجليزية وتتميز بالاختصاصات الهندسية والإدارية</li>

            <li>تضم الجامعة حاليًا 23000 طالبًا ، وما يقرب من 1000 عضو هيئة تدريس ، و 7 كليات ، و 3 معاهد ، و 4 مدارس ، و 3 مدارس مهنية ، و 150 برنامجًا تقدم التعليم لطلابها الجامعيين وطلاب الدراسات العليا والدراسات العليا</li>

            <li>تعتمد الجامعة اللغة الإنجليزية كلغة رئيسية لتدريس برامجها المتنوعة</li>

            <li>الجامعة لها عضوية في العديد من الهيئات والمنظمات التعليمية المحلية والدولية كرابطة الجامعات الدولية laureate international universities، و رابطة الجامعات الأوروبية وجمعية النهوض بكليات إدارة الأعمال و KalDer التركية وغيرها</li>

            <li>لدى الجامعة إتفاقيات ثنائية مع العديد من الجامعات الدولية أبرزها American University Washington College of Law و State University of New York, Oswego و غيرها العديد من الجامعات</li>

            <li>تضم الجامعة مركزا للتوظيف والذي يوفر التدريب التطوعي للطلاب، مما يوفر لهم فرصًا عديدة ومميزة للحصول على خبرة عملية قوية. فبفضل التدريب الذي يقدمه المركز أتيحت الفرصة للعديد من طلابنا لمعرفة ما يحتاجون إليه حقًا في حياتهم المهنية. وبالتالي يمكنهم بدء عملهم بثقةً أكبر. كما يدعم المركز الطلاب والخريجين وينظم العديد من النشاطات المختلفة لتطوير مهاراتهم المهنية.</li>

          </ul>

        </div>

        <div className={cls.info}>

          <div className={cls.part}>

            <h4><i className="fa-light fa-glasses"></i> رؤية جامعة القاهرة</h4>

            <p>أن تكون جامعة دولية تندمج مع معاير العلم والفن ، وتحتضن الحرية ، و تشارك فى دور ريادي من أجل تنمية المجتمع ، وتوفر مكانًا يتشارك فيه الطلاب وأعضاء هيئة التدريس شغفًا بالتعلم ، حيث يكرس جميع الأعضاء الأكاديميين والإداريين على حد سواء أنفسهم لتحقيق هذه الغاية.</p>

          </div>

          <div className={cls.part}>

            <h4><i className="fa-light fa-briefcase"></i> مهمة جامعة القاهرة</h4>

            <p>تتعهد جامعة اسطنبول بيلجي بالمساهمة في العلوم والإنتاج الفني وتطوير التكنولوجيا ؛ لتثقيف الأفراد الذين تطورت مهاراتهم في البحث وحل المشكلات في جو من الفكر الحر والوعي بالمسؤولية الإجتماعية ، والذين تتوافق كفاءاتهم مع المعايير الدولية ، بالإضافة إلى احترام قواعد الأخلاق والموضوعية المهنية ، منفتحون أيضًا على العديد من: المناهج التأديبية ولخدمة المجتمع ضمن معايير الجودة .</p>

          </div>

          <div className={cls.part}>

            <h4><i className="fa-light fa-city"></i> الجرم الجامعي لجامعة القاهرة</h4>

            <p>يعد موقع إسطنبول بيلجى موقعا متميزا بالنسبة لباقى الجامعات التركية فى اسطنبول حيث تضم جامعة اسطنبول بيلجي ثلاثة أحرم جامعية تقع في موقع مركزي وتوفر حياة طلابية نابضة بالحياة . يحث أنها قريبة من ما يقرب من 1000 حدث اجتماعي وثقافي سنويًا: كوشتبى و دولابديري و سنترال اسطنبول.تتوفر فى جميع أحرم جامعة اسطنبول بيلجي كافيتريات ومطاعم تلبي احتياجات تقديم الطعام ،الوجبات الخفيفة و المشروبات المختلفة للطلاب والموظفين.</p>

          </div>

          <div className={cls.part}>

            <h4><i className="fa-light fa-books"></i> المكتبة والموارد الإلكترونية</h4>

            <p>تقدم مكتبة جامعة اسطنبول بيلجي مساهمة مباشرة في التعليم والبحث والتطوير الفكري للطلاب. حيث توفر ثلاث مكتبات وسبع قاعات دراسية بمساحات مختلفة مثل أقسام الدراسة والقراءة للإستخدام الفردي والجماعي ، وزوايا تكنولوجيا المعلومات .</p>

          </div>

        </div>

      </div>

    </div>
  )
}

export default UniversityInfo